units = [
{'id': 'NMB', 'uid': '0002002401AC0001', 'n': 'шт', 'd': 'Штука', 'c': '796'} ,     
{'id': 'NMP', 'uid': '0002002401AC0006', 'n': 'упак', 'd': 'Упаковка', 'c': '778'} ,
{'id': 'LEF', 'uid': '0002002401B80001', 'n': 'л.', 'd': 'Лист', 'c': '625'} ,      
{'id': 'NPR', 'uid': '0002002402870005', 'n': 'пар', 'd': 'Пара', 'c': '715'} ,
{'id': 'NPL', 'uid': '00020024013D0002', 'n': 'рул', 'd': 'Рулон', 'c': '736'} ,
{'id': 'MTR', 'uid': '0002002401AC0005', 'n': 'м', 'd': 'Метр', 'c': '006'} ,
{'id': 'CMT', 'uid': '0002002403AD0001', 'n': 'см', 'd': 'Сантиметр', 'c': '004'} ,
{'id': 'DMT', 'uid': '0002002403B10001', 'n': 'дм', 'd': 'Дециметр', 'c': '005'} ,
{'id': 'MMT', 'uid': '0002002401D70005', 'n': 'мм', 'd': 'Миллиметр', 'c': '003'} ,
{'id': 'KMT', 'uid': '0002002401D70001', 'n': 'км', 'd': 'Километр', 'c': '008'} ,
{'id': '018', 'uid': '00020024013D0001', 'n': 'пог.м', 'd': 'Погонный_метр', 'c': '018'} ,
{'id': 'MTK', 'uid': '00020024013D0003', 'n': 'м2', 'd': 'Квадратный_метр', 'c': '055'} ,
{'id': 'CMK', 'uid': '0002002403AD0002', 'n': 'см2', 'd': 'Квадратный_сантиметр', 'c': '051'} ,
{'id': 'MTQ', 'uid': '00020024013D0005', 'n': 'м3', 'd': 'Кубический_мет', 'c': '113'} ,
{'id': 'CMQ', 'uid': '0002002403AD0003', 'n': 'см3', 'd': 'Кубический_сантиметр', 'c': '111'} ,
{'id': 'DMQ', 'uid': '0002002403B10002', 'n': 'дм3', 'd': 'Кубический_дециметр', 'c': '112+'} ,
{'id': 'MMQ', 'uid': '0002002403B10003', 'n': 'мм3', 'd': 'Кубический_миллиметр', 'c': '110'} ,
{'id': '114', 'uid': '0002002402870003', 'n': 'тыс_м3', 'd': 'Тысяча_кубических_метров', 'c': '114'} ,
{'id': 'TNE', 'uid': '00020024013D0004', 'n': 'т', 'd': 'Тонна', 'c': '168'} ,
{'id': 'KGM', 'uid': '0002002401AC0003', 'n': 'кг', 'd': 'Килограмм', 'c': '166'} ,
{'id': 'GRM', 'uid': '0002002401AC0004', 'n': 'г', 'd': 'Грамм', 'c': '163'} ,
{'id': 'KWH', 'uid': '0002002402870001', 'n': 'кВт.ч', 'd': 'Киловатт/час', 'c': '10'} ,
{'id': 'LTR', 'uid': '0002002401AC0002', 'n': 'л', 'd': 'Литр', 'c': '112'} ,
{'id': 'MLT', 'uid': '0002002402870004', 'n': 'мл', 'd': 'Миллилитр', 'c': '(МЛ)"'} ,
{'id': 'SEC', 'uid': '0002002401D70002', 'n': 'с', 'd': 'Секунда', 'c': '354'} ,
{'id': 'HUR', 'uid': '0002002403530001', 'n': 'ч', 'd': 'Час', 'c': '356'} ,
{'id': 'MIN', 'uid': '0002002401D70003', 'n': 'мин', 'd': 'Минута', 'c': '355'} ,
{'id': 'DAY', 'uid': '00020024034F0001', 'n': 'дн', 'd': 'Сутки', 'c': '359'} ,
{'id': 'WEE', 'uid': '00020024034F0002', 'n': 'нед', 'd': 'Неделя', 'c': '360'} ,
{'id': 'MON', 'uid': '00020024034F0003', 'n': 'мес', 'd': 'Месяц', 'c': '362'} ,
{'id': 'QAN', 'uid': '00020024034F0004', 'n': 'кварт', 'd': 'Квартал', 'c': '364'} ,
]

unit_by_id = {}
name_by_id = {}
unit_by_uid = {}

for unit in units:
    ID = unit['id']
    UID = unit['uid']
    NAME = unit['n']
    unit_by_id[ID] = unit
    unit_by_uid[UID] = unit
    name_by_id[ID] = NAME

class UnitDict:
    def __init__(self, account_id = None):
        self.account_id = account_id
    def get(self, id):
        return name_by_id.get(id)
    def unit_by_uid(self, uid):
        return unit_by_uid.get(uid)
    def unit_by_id(self, id):
        return unit_by_uid.get(id)
    def items(self):
        return name_by_id.items()

